package rsreu.itemsharing.services;

import org.springframework.stereotype.Service;

import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

@Service
public class CityService {

    // Список городов России с населением > 100 тыс. (в алфавитном порядке)
    private static final String[] CITY_ARRAY = {
            "Абакан", "Альметьевск", "Ангарск", "Арзамас", "Армавир", "Архангельск",
            "Астрахань", "Балаково", "Балашиха", "Барнаул", "Белгород", "Бийск",
            "Благовещенск", "Братск", "Брянск", "Великий Новгород", "Владивосток",
            "Владикавказ", "Владимир", "Волгоград", "Волжский", "Вологда", "Воронеж",
            "Грозный", "Дзержинск", "Екатеринбург", "Елец", "Зеленоград", "Златоуст", "Иваново",
            "Ижевск", "Иркутск", "Йошкар-Ола", "Казань", "Калининград", "Калуга",
            "Каменск-Уральский", "Кемерово", "Киров", "Кисловодск", "Ковров",
            "Коломна", "Кострома", "Краснодар", "Красноярск", "Курган", "Курск",
            "Липецк", "Магнитогорск", "Майкоп", "Махачкала", "Москва",
            "Мурманск", "Муром", "Набережные Челны", "Нальчик", "Нижневартовск",
            "Нижний Новгород", "Нижний Тагил", "Новокузнецк", "Новороссийск",
            "Новосибирск", "Ногинск", "Омск", "Орел", "Оренбург", "Орск",
            "Пенза", "Пермь", "Петрозаводск", "Псков", "Пятигорск", "Ростов-на-Дону",
            "Рязань", "Самара", "Санкт-Петербург", "Саранск", "Саратов",
            "Севастополь", "Северодвинск", "Симферополь", "Смоленск", "Сочи",
            "Ставрополь", "Старый Оскол", "Стерлитамак", "Сургут", "Сыктывкар",
            "Таганрог", "Тамбов", "Тверь", "Тольятти", "Томск", "Тула",
            "Тюмень", "Улан-Удэ", "Ульяновск", "Уфа", "Хабаровск", "Химки",
            "Чебоксары", "Челябинск", "Череповец", "Чита", "Шахты", "Энгельс",
            "Якутск", "Ярославль"
    };


    public List<String> getCities() {
        return Arrays.stream(CITY_ARRAY)
                .sorted()
                .collect(Collectors.toList());
    }
}